recipes/creamy-pasta-soup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Creamy Pasta Soup</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Creamy Pasta Soup</h1>
<p>
<a href="https://elavegan.com/creamy-pasta-soup-recipe/">Original link</a>
</p>

<div id="outline-container-orgbcff7da" class="outline-2">
<h2 id="orgbcff7da">Ingredients</h2>
<div class="outline-text-2" id="text-orgbcff7da">
</div>
<div id="outline-container-org2d2fba7" class="outline-3">
<h3 id="org2d2fba7">For the soup:</h3>
<div class="outline-text-3" id="text-org2d2fba7">
<ul class="org-ul">
<li>1 large (225 g) carrot, peeled and chopped</li>
<li>1-2 stalks (75 g) celery, chopped</li>
<li>200 g broccoli florets</li>
<li>1/2 tbsp oil</li>
<li>1 medium onion, diced</li>
<li>4 garlic cloves, minced</li>
<li>5-6 cups vegetable broth</li>
<li>2 tsp onion powder</li>
<li>2 tsp Italian seasoning</li>
<li>1-2 tsp ground lovage (or to taste)</li>
<li>salt and pepper to taste</li>
<li>200 g pasta</li>
<li>Fresh herbs to garnish</li>
</ul>
</div>
</div>

<div id="outline-container-orge83c438" class="outline-3">
<h3 id="orge83c438">Cashew-Cannellini Cream:</h3>
<div class="outline-text-3" id="text-orge83c438">
<ul class="org-ul">
<li>One can cannellini beans</li>
<li>1/2 cup (75 g) cashews soaked</li>
<li>1 1/2 cups plant-based milk</li>
<li>1 tbsp lemon juice</li>
<li>1/4 tsp salt</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7def651" class="outline-2">
<h2 id="org7def651">Method</h2>
<div class="outline-text-2" id="text-org7def651">
<ol class="org-ol">
<li>Soak cashews for a couple of hours OR boil them for 20 minutes in water until they are soft. Once the cashews are soft, transfer them to a blender, add the cannellini beans, the plant-based milk, lemon juice &amp; salt and blend on high speed for about 2 minutes or until super smooth and creamy. Set aside.</li>
<li>For the soup: Heat oil in a large pot over medium heat, add the onion, all veggies and fry for about 4 minutes. Then add the garlic, the spices and fry for a further minute.</li>
<li>Add in the veggie broth (I first used 5 cups but had to add another cup later). Bring to a boil and then reduce the heat.</li>
<li>Now add the cashew-cannellini cream and stir. Let the soup simmer for about 6-8 minutes.</li>
<li>Finally, add pasta of choice and let the soup simmer for about 8-10 minutes or until the pasta is al-dente (check the package instructions). Stir frequently! If the soup is too thick either add more veggie broth or plant-based milk! Taste and adjust seasoning. You will most likely need to add more salt!</li>
<li>Garnish with fresh herbs and enjoy!</li>
</ol>
</div>
</div>

<div id="outline-container-org4a3cfe7" class="outline-2">
<h2 id="org4a3cfe7">Notes</h2>
<div class="outline-text-2" id="text-org4a3cfe7">
<p>
For a nut-free version, simply use 75 grams of hemp seeds!
</p>
</div>
</div>
</div>
</body>
</html>
